hankso/esp32/espbase/main/config.c
/* 
 * File: config.c
 * Authors: Hank <hankso1106@gmail.com>
 * Create: 2020-03-12 21:49:38
 *
 */

#include "config.h"

#include "cJSON.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "esp_partition.h"

#if __has_include("esp_idf_version.h")
#    include "esp_idf_version.h"
#    if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
#        define _NVS_ITER_LIST
#    endif
#endif

#define NAMESPACE_INFO "info"
#define NAMESPACE_CFG "config"

static const char * TAG = "Config";

// default values
config_t Config = {
    .net = {
        .STA_SSID  = "",
        .STA_PASS  = "",
        .STA_HOST  = "",
        .AP_SSID   = "espbase",
        .AP_PASS   = "16011106",
        .AP_HOST   = "10.0.2.1",
        .AP_AUTO   = "1",
        .AP_HIDE   = "0",
    },
    .web = {
        .WS_NAME   = "",
        .WS_PASS   = "",
        .HTTP_NAME = "",
        .HTTP_PASS = "",
        .DIR_DATA  = "/data/",
        .DIR_DOCS  = "/docs/",
        .DIR_ROOT  = "/www/",
    },
    .app = {
        .MDNS_RUN  = "1",
        .MDNS_HOST = "",
        .OTA_RUN   = "1",
        .OTA_URL   = "",
        .USB_MODE  = "",
        .PROMPT    = "esp32> ",
    },
    .info = {
#ifdef PROJECT_NAME
        .NAME  = PROJECT_NAME,
#else
        .NAME  = "",
#endif
#ifdef PROJECT_VER
        .VER   = PROJECT_VER,
#else
        .VER   = "",
#endif
#ifdef CHIP_UID
        .UID   = CHIP_UID,
#else
        .UID   = "",
#endif
    }
};

// The rwlst is a mapping to flattened Configuration attributes.
// Low level `config_get/config_set` are actually manipulation on this array.
// Therefore, global variable `Config` is just a link to the rwlst memory.
//
// Config values are pointers to constant strings `const char *`, which should
// not be deallocated. Field `freeval` is designed to hold strdup of new value.
// Feel free to call `config_set` on `char *` (without memory leak).
typedef struct {
    const char *key;
    const char * *value;
    char * freeval;
} config_entry_t;

static config_entry_t rwlst[] = {       // read/write entries
    {"net.sta.ssid",    &Config.net.STA_SSID,   NULL},
    {"net.sta.pass",    &Config.net.STA_PASS,   NULL},
    {"net.sta.host",    &Config.net.STA_HOST,   NULL},
    {"net.ap.ssid",     &Config.net.AP_SSID,    NULL},
    {"net.ap.pass",     &Config.net.AP_PASS,    NULL},
    {"net.ap.host",     &Config.net.AP_HOST,    NULL},
    {"net.ap.auto",     &Config.net.AP_AUTO,    NULL},
    {"net.ap.hide",     &Config.net.AP_HIDE,    NULL},

    {"web.ws.name",     &Config.web.WS_NAME,    NULL},
    {"web.ws.pass",     &Config.web.WS_PASS,    NULL},
    {"web.http.name",   &Config.web.HTTP_NAME,  NULL},
    {"web.http.pass",   &Config.web.HTTP_PASS,  NULL},
    {"web.path.data",   &Config.web.DIR_DATA,   NULL},
    {"web.path.docs",   &Config.web.DIR_DOCS,   NULL},
    {"web.path.root",   &Config.web.DIR_ROOT,   NULL},

    {"app.mdns.run",    &Config.app.MDNS_RUN,   NULL},
    {"app.mdns.host",   &Config.app.MDNS_HOST,  NULL},
    {"app.ota.run",     &Config.app.OTA_RUN,    NULL},
    {"app.ota.url",     &Config.app.OTA_URL,    NULL},
    {"app.usb.mode",    &Config.app.USB_MODE,   NULL},
    {"app.prompt",      &Config.app.PROMPT,     NULL},
};

static config_entry_t rolst[] = {       // readonly entries
    {"uid",  &Config.info.UID,  NULL},
    {"name", &Config.info.NAME, NULL},
};

static uint16_t rwlen = LEN(rwlst);

/******************************************************************************
 * Configuration I/O
 */

static struct {
    bool init;                      // whether nvs flash has been initialized
    esp_err_t error;                // nvs flash init result
    nvs_handle handle;              // nvs handle obtained from nvs_open
    const esp_partition_t *part;    // nvs flash partition
} ctx = { false, ESP_OK, 0, NULL };

static int16_t config_index(const char *key) {
    LOOPN(i, rwlen) {
        if (!strcmp(key, rwlst[i].key)) return i;
    }
    return -1;
}

static esp_err_t config_set_safe(
    config_entry_t *ent, const char *value, bool commit
) {
    if (!strcmp(*ent->value, value)) return ESP_OK;
    char *tmp = strdup(value);
    if (!tmp) return ESP_ERR_NO_MEM;
    TRYFREE(ent->freeval);
    *ent->value = ent->freeval = tmp;
    if (commit && !config_nvs_open(NAMESPACE_CFG, false)) {
        nvs_set_str(ctx.handle, ent->key, *ent->value);
        config_nvs_close();
    }
    return ESP_OK;
}

bool config_set(const char *key, const char *value) {
    int16_t idx = config_index(key);
    if (idx == -1) return false;
    return config_set_safe(rwlst + idx, value ? value : "", true) == ESP_OK;
}

const char * config_get(const char *key) {
    int16_t idx = config_index(key);
    return idx == -1 ? "Unknown" : *rwlst[idx].value;
}

void config_list() {
#ifdef CONFIG_AUTO_ALIGN
    size_t keylen = 0;
    LOOPN(i, rwlen) { keylen = MAX(keylen, strlen(rwlst[i].key)); }
#else
    size_t keylen = 16;
#endif
    printf("Namespace: " NAMESPACE_CFG "\n  %-*s Value\n", keylen, "Key");
    LOOPN(i, rwlen) {
        printf("  %-*s ", keylen, rwlst[i].key);
        if (endswith(rwlst[i].key, "pass")) {
            LPCHR('*', MIN(strlen(*rwlst[i].value), 16));
        } else {
            printf(*rwlst[i].value);
        }
        printf("%s\n", rwlst[i].freeval ? " (modified)" : "");
    }
}

static void set_config_callback(const char *key, cJSON *item) {
    if (!cJSON_IsString(item)) {
        if (!cJSON_IsObject(item)) {
            ESP_LOGE(TAG, "Invalid type of `%s`", cJSON_Print(item));
        }
        return;
    }
    const char *val = item->valuestring;
    if (!config_set(key, val))
        ESP_LOGD(TAG, "JSON Config set `%s` to `%s` failed", key, val);
}

static void json_parse_object_recurse(
    cJSON *item, void (*cb)(const char *, cJSON *), const char *root
) {
    while (item) {
        if (item->string == NULL) {  // may be the root object
            if (item->child) json_parse_object_recurse(item->child, cb, root);
            item = item->next;
            continue;
        }

        // resolve key string with parent's name
        char *key;
        uint8_t rlen = strlen(root);
        uint8_t slen = strlen(item->string) + (rlen ? rlen + 1 : 0) + 1;
        if (EALLOC(key, slen)) continue;
        snprintf(key, slen, "%s%s%s", root, rlen ? "." : "", item->string);

        (*cb)(key, item);

        // recurse to child and iterate to next sibling
        if (item->child) json_parse_object_recurse(item->child, cb, key);
        item = item->next;
        TRYFREE(key);
    }
}

bool config_loads(const char *json) {
    cJSON *obj = cJSON_Parse(json);
    if (!obj) {
        ESP_LOGE(TAG, "Could not parse JSON: %s", cJSON_GetErrorPtr());
        return false;
    } else {
        json_parse_object_recurse(obj, &set_config_callback, "");
        cJSON_Delete(obj);
        return true;
    }
}

char * config_dumps() {
    cJSON *obj = cJSON_CreateObject();
    LOOPN(i, rwlen) {
        cJSON_AddStringToObject(obj, rwlst[i].key, *rwlst[i].value);
    }
    char *string = cJSON_PrintUnformatted(obj);
    cJSON_Delete(obj);
    return string;
}

/******************************************************************************
 * Configuration utilities
 */

static esp_err_t nvs_load_str(config_entry_t *ent) {
    size_t len = 0;
    char *buf = NULL;
    esp_err_t err = nvs_get_str(ctx.handle, ent->key, NULL, &len);
    if (!err) err = EALLOC(buf, len);
    if (!err) err = nvs_get_str(ctx.handle, ent->key, buf, &len);
    if (!err) err = config_set_safe(ent, buf, false);
    TRYFREE(buf);
    return err;
}

static esp_err_t nvs_load_val_ro(nvs_entry_info_t *info, char **vptr) {
    char *buf = NULL;
    size_t len = 16;
    uint8_t data[8];
    nvs_handle hdl;
    esp_err_t err = nvs_open(info->namespace_name, NVS_READONLY, &hdl);
    if (err) return err;
    if (info->type == NVS_TYPE_STR) {
        if (!err) err = nvs_get_str(hdl, info->key, NULL, &len);
        if (!err) err = EALLOC(buf, len);
        if (!err) err = nvs_get_str(hdl, info->key, buf, &len);
    } else if (info->type == NVS_TYPE_BLOB) {
        if (!err) err = nvs_get_blob(hdl, info->key, NULL, &len);
        if (!err) err = EALLOC(buf, len * 3);
        if (!err) err = nvs_get_blob(hdl, info->key, buf + len * 2, &len);
        if (!err) hexdumps((uint8_t *)(buf + len * 2), buf, len, 32);
    } else if (!( err = EALLOC(buf, len) )) {
        switch (info->type) {
            case NVS_TYPE_U8:
                err = nvs_get_u8(hdl, info->key, (uint8_t *)data);
                snprintf(buf, len, "%u", *(uint8_t *)data);
                break;
            case NVS_TYPE_I8:
                err = nvs_get_i8(hdl, info->key, (int8_t *)data);
                snprintf(buf, len, "%d", *(int8_t *)data);
                break;
            case NVS_TYPE_U16:
                err = nvs_get_u16(hdl, info->key, (uint16_t *)data);
                snprintf(buf, len, "%u", *(uint16_t *)data);
                break;
            case NVS_TYPE_I16:
                err = nvs_get_i16(hdl, info->key, (int16_t *)data);
                snprintf(buf, len, "%d", *(int16_t *)data);
                break;
            case NVS_TYPE_U32:
                err = nvs_get_u32(hdl, info->key, (uint32_t *)data);
                snprintf(buf, len, "%u", *(uint32_t *)data);
                break;
            case NVS_TYPE_I32:
                err = nvs_get_i32(hdl, info->key, (int32_t *)data);
                snprintf(buf, len, "%d", *(int32_t *)data);
                break;
            case NVS_TYPE_U64:
                err = nvs_get_u64(hdl, info->key, (uint64_t *)data);
                snprintf(buf, len, "%llu", *(uint64_t *)data);
                break;
            case NVS_TYPE_I64:
                err = nvs_get_i64(hdl, info->key, (int64_t *)data);
                snprintf(buf, len, "%lld", *(int64_t *)data);
                break;
            default: err = ESP_ERR_INVALID_STATE;
        }
    }
    if (hdl) nvs_close(hdl);
    if (err) TRYFREE(buf);
    *vptr = buf;
    return err;
}

esp_err_t config_nvs_init() {
    if (ctx.init) return ctx.error;
    ctx.part = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_NVS, NULL);
    if (ctx.part == NULL) {
        ESP_LOGE(TAG, "Could not found nvs partition. Skip");
        ctx.init = true;
        return ctx.error = ESP_ERR_NOT_FOUND;
    }
#ifdef CONFIG_AUTOSTART_ARDUINO
    nvs_flash_deinit();
#endif
    esp_err_t err;
    bool enc = false;
#ifdef CONFIG_NVS_ENCRYPT
    enc = true;
    const esp_partition_t *keys = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_NVS_KEY, NULL);
    if (keys != NULL) {
        nvs_sec_cfg_t *cfg;
        err = nvs_flash_read_security_cfg(keys, cfg);
        if (err == ESP_ERR_NVS_KEYS_NOT_INITIALIZED) {
            err = nvs_flash_generate_keys(keys, cfg);
        }
        if (!err) {
            err = nvs_flash_secure_init_partition(ctx.part->label, cfg);
        } else {
            ESP_LOGE(TAG, "Could not initialize nvs with encryption: %s",
                     esp_err_to_name(err));
            enc = false;
        }
    } else { enc = false; }
#endif
    if (!enc) err = nvs_flash_init_partition(ctx.part->label);
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        err = nvs_flash_erase_partition(ctx.part->label);
        if (!err) { // partition cleared. we try again
#ifdef CONFIG_NVS_ENCRYPT
            if (enc) {
                err = nvs_flash_secure_init_partition(ctx.part->label, cfg);
            } else
#endif
            {
                err = nvs_flash_init_partition(ctx.part->label);
            }
        }
    }
    if (err) {
        ESP_LOGE(TAG, "Could not init nvs flash: %s", esp_err_to_name(err));
    }
    ctx.init = true;
    ctx.error = err;
    return err;
}

esp_err_t config_nvs_open(const char *ns, bool ro) {
    if (ctx.handle) return ESP_FAIL;
    esp_err_t err = ctx.init ? ESP_OK : config_nvs_init();
    if (!err) err = nvs_open(ns, ro ? NVS_READONLY : NVS_READWRITE, &ctx.handle);
    if (err) ESP_LOGE(TAG, "open `%s` fail: %s", ns, esp_err_to_name(err));
    return err;
}

esp_err_t config_nvs_commit() {
    if (!ctx.handle) return ESP_ERR_NVS_INVALID_HANDLE;
    esp_err_t err = nvs_commit(ctx.handle);
    if (err) ESP_LOGE(TAG, "commit fail: %s", esp_err_to_name(err));
    return err;
}

esp_err_t config_nvs_close() {
    if (!ctx.handle) return ESP_ERR_NVS_INVALID_HANDLE;
    esp_err_t err = config_nvs_commit();
    nvs_close(ctx.handle); ctx.handle = 0;
    return err;
}

bool config_nvs_remove(const char *key) {
    if (config_nvs_open(NAMESPACE_CFG, false)) return false;
    esp_err_t err = nvs_erase_key(ctx.handle, key);
    if (err) ESP_LOGE(TAG, "erase `%s` fail: %s", key, esp_err_to_name(err));
    return config_nvs_close() == ESP_OK;
}

bool config_nvs_clear() {
    if (config_nvs_open(NAMESPACE_CFG, false)) return false;
    esp_err_t err = nvs_erase_all(ctx.handle);
    if (err) ESP_LOGE(TAG, "erase nvs data fail: %s", esp_err_to_name(err));
    return config_nvs_close() == ESP_OK;
}

bool config_nvs_load() {
    esp_err_t err;
    if (config_nvs_open(NAMESPACE_CFG, true)) return false;
    LOOPN(i, rwlen) {
        if (( err = nvs_load_str(rwlst + i) )) {
            ESP_LOGD(TAG, "get nvs `%s` failed: %s",
                    rwlst[i].key, esp_err_to_name(err));
        }
    }
    return config_nvs_close() == ESP_OK;
}

bool config_nvs_dump() {
    if (config_nvs_open(NAMESPACE_CFG, false)) return false;
    bool success = true;
    LOOPN(i, rwlen) {
        if (nvs_set_str(ctx.handle, rwlst[i].key, *rwlst[i].value)) {
            success = false;
            break;
        }
    }
    return (config_nvs_close() == ESP_OK) && success;
}

static const char * nvs_type_str(nvs_type_t type) {
    static char buf[5];
    switch (type) {
        CASESTR(NVS_TYPE_U8, 9);
        CASESTR(NVS_TYPE_I8, 9);
        CASESTR(NVS_TYPE_U16, 9);
        CASESTR(NVS_TYPE_I16, 9);
        CASESTR(NVS_TYPE_U32, 9);
        CASESTR(NVS_TYPE_I32, 9);
        CASESTR(NVS_TYPE_U64, 9);
        CASESTR(NVS_TYPE_I64, 9);
        CASESTR(NVS_TYPE_STR, 9);
        CASESTR(NVS_TYPE_BLOB, 9);
        CASESTR(NVS_TYPE_ANY, 9);
        default:
            snprintf(buf, sizeof(buf), "0x%02X", type);
            return buf;
    }
}

void config_nvs_list(bool all) {
    if (ctx.part == NULL) {
        ESP_LOGE(TAG, "Could not found nvs partition. Skip");
        return;
    }
#ifdef _NVS_ITER_LIST
    const char *ns = all ? NULL : NAMESPACE_CFG, *val;
    nvs_entry_info_t info;
    nvs_iterator_t iter = nvs_entry_find(ctx.part->label, ns, NVS_TYPE_ANY);
    if (!iter) {
        ESP_LOGE(TAG, "No entries found for namespace `%s` in parition `%s`",
                 all ? "all" : ns, ctx.part->label);
        return;
    }
#   ifdef CONFIG_AUTO_ALIGN
    size_t nslen = 0, keylen = 0;
    while (iter) {
        nvs_entry_info(iter, &info);
        iter = nvs_entry_next(iter);
        nslen = MAX(nslen, strlen(info.namespace_name));
        keylen = MAX(keylen, strlen(info.key));
    }
    nvs_release_iterator(iter);
    iter = nvs_entry_find(ctx.part->label, ns, NVS_TYPE_ANY);
#   else
    size_t nslen = 16, keylen = NVS_KEY_NAME_MAX_SIZE; // see nvs.h
#   endif
    if (all) {
        printf("%-*s %-*s Type Value\n", nslen, "Namespace", keylen, "Key");
    } else {
        printf("Namespace: %s\n  %-*s Type Value\n", ns, keylen, "Key");
    }
    while (iter) {
        nvs_entry_info(iter, &info);
        iter = nvs_entry_next(iter);
        char *tmp = NULL;
        if (!strcmp(info.namespace_name, NAMESPACE_CFG)) {
            val = config_get(info.key);
        } else {
            val = nvs_load_val_ro(&info, &tmp) ? "" : tmp;
        }
        printf("%-*s %-*s %4s ",
                all ? nslen : 1, all ? info.namespace_name : " ",
                keylen, info.key, nvs_type_str(info.type));
        if (endswith(info.key, "pass") || endswith(info.key, "pswd")) {
            LPCHRN('*', MIN(strlen(val), 16));
        } else {
            puts(val);
        }
        TRYFREE(tmp);
    }
    nvs_release_iterator(iter);
#else
    ESP_LOGE(TAG, "NVS Entries iteration not supported");
#endif
}

void config_nvs_stats() {
    if (ctx.part == NULL) {
        ESP_LOGE(TAG, "Could not found nvs partition. Skip");
        return;
    }
    nvs_stats_t nvs_stats;
    esp_err_t err = nvs_get_stats(ctx.part->label, &nvs_stats);
    if (err) {
        ESP_LOGE(TAG, "Could not get nvs status: %s", esp_err_to_name(err));
        return;
    }
    printf(
        "NVS Partition Size: %s\n"
        "  Namespaces: %d\n"
        "  Entries: %d/%d (%.2f %% free)\n",
        format_size(ctx.part->size, false), nvs_stats.namespace_count,
        nvs_stats.used_entries, nvs_stats.total_entries,
        100.0 * nvs_stats.free_entries / nvs_stats.total_entries
    );
}

void config_initialize() {
    esp_err_t err;
    config_nvs_init();

    // load readonly values
    if (config_nvs_open(NAMESPACE_INFO, true) == ESP_OK) {
        LOOPN(i, LEN(rolst)) {
            if (( err = nvs_load_str(rolst + i) )) {
                ESP_LOGD(TAG, "get nvs `%s` failed: %s",
                        rolst[i].key, esp_err_to_name(err));
            }
        }
        config_nvs_close();
    }

    // startup times counter test
    if (config_nvs_open(NAMESPACE_INFO, false) == ESP_OK) {
        uint32_t counter = 0;
        if (( err = nvs_get_u32(ctx.handle, "counter", &counter) )) {
            ESP_LOGE(TAG, "get u32 `counter` fail: %s", esp_err_to_name(err));
        }
        counter++;
        ESP_LOGI(TAG, "Current run times: %u", counter);
        if (( err = nvs_set_u32(ctx.handle, "counter", counter) )) {
            ESP_LOGE(TAG, "set u32 `counter` fail: %s", esp_err_to_name(err));
        }
        config_nvs_close();
    }

    config_nvs_load();
}
